Revit 2027 API
FilteredElementCollector.GetElementIterator Method
 Returns an element iterator to the elements passing the filters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FilteredElementIterator GetElementIterator()
Public Function GetElementIterator As FilteredElementIterator
public:
FilteredElementIterator^ GetElementIterator()
member GetElementIterator : unit -> FilteredElementIterator
Return Value
FilteredElementIterator
Exceptions
Exception | Condition
InvalidOperationException |  The collector does not have a filter applied. Extraction or iteration of elements is not permitted without a filter.
Remarks
 Calling this when you have an active iterator to this same collector will result in the first iterator being stopped by this call.
Example
FilteredElementCollector collector = new FilteredElementCollector(document);
// Apply a filter to get all pipes in the document
collector.OfClass(typeof(Autodesk.Revit.DB.Plumbing.Pipe));
// Get results as an element iterator and look for a pipe with
// a specific flow state
FilteredElementIterator elemItr = collector.GetElementIterator();
elemItr.Reset();
while (elemItr.MoveNext())
{
    Pipe pipe = elemItr.Current as Pipe;
    if (pipe.FlowState == PipeFlowState.LaminarState)
    {
        TaskDialog.Show("Revit", "Model has at least one pipe with Laminar flow state.");
        break;
    }
}
See Also
Reference
FilteredElementCollector Class
Autodesk.Revit.DB Namespace